[
  {
    "image": "https://i.ibb.co/3mwyhv1s/unnamed.png",
    "title": "WhatsApp: Simple. Reliable. Private.",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "WhatsApp is a fast, simple, and secure messaging app that lets you stay connected with family, friends, and colleagues anywhere in the world. Send messages, make crystal-clear voice or video calls, and share moments instantly through photos, videos, documents, and voice notes. With end-to-end encryption, only you and the people you communicate with can read what’s sent. Create group chats to stay in touch with loved ones, plan events, or collaborate with your team. Express yourself with emojis, GIFs, and custom stickers. WhatsApp also syncs across devices, making it easy to continue conversations on the web or desktop. Lightweight, ad-free, and designed for reliability, WhatsApp delivers a seamless communication experience that works even on slow networks. Stay close to the people who matter most — anywhere, anytime.",
    "size": 52,
    "reviews": 1842,
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 123 },
      { "name": "2 star", "count": 214 },
      { "name": "3 star", "count": 412 },
      { "name": "4 star", "count": 630 },
      { "name": "5 star", "count": 1463 }
    ]
  },
  {
    "image": "https://i.ibb.co/jvVyZmtC/igg.png",
    "title": "Instagram: Capture & Share the World",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram is where creativity meets community. Capture life’s best moments and share them through photos, reels, or stories with friends and followers worldwide. Whether you’re a casual user or a creator, Instagram gives you powerful tools to edit, filter, and personalize every post. Explore your interests with the Discover tab, follow favorite influencers or brands, and get inspired by trending content. Stay connected with direct messages and group chats, or go live to interact instantly with your audience. Build your personal brand, grow your small business, or just express your creativity through visuals that tell your story. With customizable privacy controls, Instagram puts you in charge of what you share and who sees it. Join millions of users expressing themselves through art, travel, food, and lifestyle — one post at a time.",
    "size": 78,
    "reviews": 4120,
    "ratingAvg": 4.8,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 210 },
      { "name": "2 star", "count": 320 },
      { "name": "3 star", "count": 420 },
      { "name": "4 star", "count": 980 },
      { "name": "5 star", "count": 2190 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/tiktok.com",
    "title": "TikTok: Real Videos, Real People",
    "companyName": "ByteDance Ltd.",
    "id": 3,
    "description": "TikTok is your window into creativity, culture, and community. Discover short, entertaining videos made by real people from around the world. Dance, sing, cook, laugh, or learn something new — there’s a TikTok for everyone. The powerful built-in editor makes it easy to create your own videos using sound effects, filters, and trending music. Your personalized For You feed curates content based on what you love, so you’ll never run out of entertainment. Collaborate with other creators through duets and challenges, or simply share your fun moments with friends. TikTok celebrates realness and creativity, empowering anyone to go viral. Whether you’re discovering trends or starting one, it’s the app that turns everyday life into an unforgettable story. Join the movement and let your creativity shine with TikTok.",
    "size": 66,
    "reviews": 990,
    "ratingAvg": 4.3,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 123 },
      { "name": "2 star", "count": 208 },
      { "name": "3 star", "count": 260 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 480 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com",
    "title": "Spotify: Music & Podcasts",
    "companyName": "Spotify AB",
    "id": 4,
    "description": "Spotify is your ultimate audio companion, offering millions of songs, albums, and podcasts to fit every mood and moment. Stream your favorite artists, discover new releases, and explore personalized playlists crafted just for you. From morning workouts to late-night study sessions, Spotify sets the soundtrack of your life. Create and share playlists with friends, or follow the ones you love. Explore podcasts across genres — comedy, education, news, and more — all in one place. With Spotify Premium, enjoy ad-free listening, offline downloads, and unlimited skips. Its simple interface and cross-device sync make switching between mobile, tablet, and desktop effortless. Wherever you go, Spotify brings the world’s music to your fingertips. Press play and discover why millions choose Spotify to listen, learn, and relax every day.",
    "size": 41,
    "reviews": 1270,
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 230 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 780 }
    ]
  },
  {
    "image": "https://i.ibb.co/xKTL9h9C/images.jpg",
    "title": "Zoom: One Platform to Connect",
    "companyName": "Zoom Video Communications",
    "id": 5,
    "description": "Zoom connects people, teams, and communities worldwide through powerful video meetings, chat, and collaboration tools. Start or join high-quality video calls with just a tap, whether for work, school, or personal catchups. Share your screen, collaborate on projects, and record meetings with ease. Stay connected anywhere with seamless cross-device performance. Built-in security features ensure your meetings remain private and protected. Chat with coworkers, send files, or join webinars right from the app. Schedule and manage meetings directly through calendar integration. Zoom brings simplicity, stability, and clarity to remote communication, helping you get more done together. Whether you’re hosting a virtual classroom, business meeting, or online hangout, Zoom delivers a reliable and professional experience that makes you feel close, no matter the distance.",
    "size": 38,
    "reviews": 2100,
    "ratingAvg": 4.7,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 270 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 920 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/duolingo.com",
    "title": "Duolingo: Language Lessons",
    "companyName": "Duolingo, Inc.",
    "id": 6,
    "description": "Duolingo turns learning a new language into a fun and motivating daily habit. With bite-sized lessons, gamified challenges, and personalized feedback, you can master over 30 languages including Spanish, French, Japanese, and more. Earn points, unlock achievements, and maintain your streak as you progress. Each lesson is quick, effective, and designed to improve reading, listening, and speaking skills. The friendly owl mascot keeps you encouraged as you learn at your own pace. Whether you’re preparing for travel, work, or personal growth, Duolingo makes learning accessible to everyone — free of charge. Stay consistent, track your progress, and celebrate milestones with a global community of learners. Duolingo makes language learning simple, social, and rewarding.",
    "size": 60,
    "reviews": 1875,
    "ratingAvg": 4.6,
    "downloads": "300M",
    "ratings": [
      { "name": "1 star", "count": 170 },
      { "name": "2 star", "count": 230 },
      { "name": "3 star", "count": 370 },
      { "name": "4 star", "count": 590 },
      { "name": "5 star", "count": 960 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/canva.com",
    "title": "Canva: Design Photos & Videos",
    "companyName": "Canva Pty Ltd.",
    "id": 7,
    "description": "Canva lets anyone design stunning visuals effortlessly — from social media posts to business presentations. Choose from thousands of templates and customize with text, images, icons, and videos. The intuitive drag-and-drop editor makes designing simple, even for beginners. Collaborate with teammates in real-time, share feedback instantly, and export your creations in high quality. Canva Pro users can enjoy advanced features like background remover, premium templates, and brand kits. Perfect for students, professionals, and small businesses, Canva brings your creative ideas to life with ease. Whether you’re designing a resume, poster, logo, or Instagram story, Canva gives you everything you need in one place. Create, edit, and share your designs anywhere — because great design belongs to everyone.",
    "size": 50,
    "reviews": 1120,
    "ratingAvg": 4.2,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 280 },
      { "name": "4 star", "count": 340 },
      { "name": "5 star", "count": 420 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/uber.com",
    "title": "Uber: Ride Hailing & Delivery",
    "companyName": "Uber Technologies, Inc.",
    "id": 8,
    "description": "Uber simplifies getting from point A to B with reliable rides and fast deliveries. Request a ride in seconds, track your driver in real-time, and enjoy safe, cashless payments. Choose from a range of ride options — economy, premium, or shared — all priced upfront for transparency. Hungry? Order your favorite meals through Uber Eats and have them delivered fast. Built-in safety features like GPS tracking, trip sharing, and 24/7 support ensure peace of mind on every journey. Whether you’re commuting to work, catching a flight, or exploring a new city, Uber gets you there conveniently and comfortably. Trusted by millions worldwide, Uber combines innovation, safety, and efficiency into one simple app — your everyday travel and delivery solution.",
    "size": 95,
    "reviews": 3240,
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 310 },
      { "name": "2 star", "count": 410 },
      { "name": "3 star", "count": 520 },
      { "name": "4 star", "count": 960 },
      { "name": "5 star", "count": 1040 }
    ]
  },
  {
    "image": "https://i.ibb.co/TC1QcFH/unnamed.jpg",
    "title": "Adobe Acrobat Reader: PDF Editor",
    "companyName": "Adobe Inc.",
    "id": 9,
    "description": "Adobe Acrobat Reader makes managing PDF files simple and professional. View, edit, and share documents on the go with powerful yet intuitive tools. Highlight text, add comments, fill out forms, and sign contracts digitally. Use the built-in scanner to convert photos or paper files into PDFs instantly. Access your files anywhere using cloud sync, and easily share them via email or messaging apps. Integration with Dropbox, Google Drive, and OneDrive keeps your workflow smooth. Whether reviewing reports or signing official documents, Adobe ensures a fast, secure, and reliable experience. For professionals, students, and anyone in between, Acrobat Reader delivers everything you need to stay productive — all from your mobile device.",
    "size": 72,
    "reviews": 940,
    "ratingAvg": 4.5,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 240 },
      { "name": "4 star", "count": 310 },
      { "name": "5 star", "count": 580 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/netflix.com",
    "title": "Netflix: Watch TV & Movies",
    "companyName": "Netflix, Inc.",
    "id": 10,
    "description": "Netflix offers unlimited entertainment right at your fingertips. Stream award-winning series, movies, documentaries, and exclusive originals — anytime, anywhere. Discover personalized recommendations that fit your taste, or explore new genres daily. Download your favorite shows for offline viewing and never miss an episode. Create multiple profiles for family members, including a kid-friendly mode for safe browsing. Enjoy seamless playback, no ads, and new releases every week. Whether you love thrillers, comedies, romance, or anime, Netflix has something for everyone. With HD streaming, smart suggestions, and a world of content just a tap away, it’s your all-in-one app for endless fun and relaxation.",
    "size": 81,
    "reviews": 2450,
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 350 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1040 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org",
    "title": "Telegram: Take Back Your Privacy",
    "companyName": "Telegram FZ-LLC",
    "id": 11,
    "description": "Telegram is a fast, secure, and privacy-first messaging app designed for everyone. Send unlimited messages, photos, and files of any size, and access them instantly across devices through cloud sync. Create group chats with thousands of members, follow public channels, or use bots for automation. Telegram’s Secret Chats feature offers end-to-end encryption for maximum security. Customize your experience with themes, stickers, and animated emojis. With no ads or data tracking, Telegram puts your privacy first. Whether chatting with friends, managing a community, or broadcasting to audiences, Telegram gives you speed and freedom like no other app. Stay connected the smarter, safer way.",
    "size": 64,
    "reviews": 1580,
    "ratingAvg": 4.8,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 410 },
      { "name": "5 star", "count": 790 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/microsoft.com",
    "title": "Microsoft Outlook: Email & Calendar",
    "companyName": "Microsoft Corporation",
    "id": 12,
    "description": "Microsoft Outlook keeps your emails, calendar, and contacts perfectly organized in one place. Manage multiple accounts, schedule meetings, and get smart reminders for important tasks. Outlook’s Focused Inbox filters out clutter, helping you focus on what matters most. Attach and view files from OneDrive or Google Drive without leaving the app. Integrated Teams and Zoom support make joining online meetings seamless. Advanced spam protection and encryption ensure your data stays private and secure. Whether for business or personal use, Outlook simplifies how you communicate, schedule, and stay on top of your day. Reliable, secure, and easy to use — your inbox just got smarter.",
    "size": 58,
    "reviews": 3210,
    "ratingAvg": 4.1,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 420 },
      { "name": "2 star", "count": 510 },
      { "name": "3 star", "count": 760 },
      { "name": "4 star", "count": 850 },
      { "name": "5 star", "count": 670 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/dropbox.com",
    "title": "Dropbox: Cloud Storage",
    "companyName": "Dropbox Inc.",
    "id": 13,
    "description": "Dropbox is your trusted cloud storage companion for saving, sharing, and collaborating on files anywhere. Upload photos, documents, and videos, and access them securely across all your devices. Share files with a simple link — no attachments needed. Work collaboratively with teammates in shared folders that update instantly. Offline mode ensures your files are available even without internet access. Built-in document scanner and automatic photo backup make organizing your digital life effortless. Dropbox also integrates with popular tools like Microsoft Office and Google Workspace. Secure, fast, and reliable — it’s your digital workspace in the cloud, designed to make work and life simpler.",
    "size": 91,
    "reviews": 2750,
    "ratingAvg": 4.9,
    "downloads": "600M",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 390 },
      { "name": "5 star", "count": 2050 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/google.com",
    "title": "Google Maps: Navigation & Transit",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Google Maps is your ultimate navigation partner for exploring the world. Get real-time GPS navigation, live traffic updates, and turn-by-turn directions to any destination. Discover nearby restaurants, gas stations, and attractions easily. With offline maps, you can navigate even without internet access. Public transit information, cycling routes, and walking paths make getting around stress-free. Street View lets you explore landmarks before visiting, while reviews and photos help you make informed choices. Google Maps continually updates to provide accurate information on roads, businesses, and closures. Whether commuting to work or traveling abroad, it ensures you reach your destination confidently and efficiently.",
    "size": 105,
    "reviews": 4670,
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 390 },
      { "name": "2 star", "count": 570 },
      { "name": "3 star", "count": 980 },
      { "name": "4 star", "count": 1330 },
      { "name": "5 star", "count": 1400 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/amazon.com",
    "title": "Amazon Shopping: Everything at your Door",
    "companyName": "Amazon Mobile LLC",
    "id": 15,
    "description": "Amazon Shopping brings millions of products to your fingertips. Browse everything from electronics and clothing to groceries and home essentials. Enjoy fast, reliable delivery, detailed product reviews, and secure checkout. Track your orders in real-time and manage returns with ease. Discover exclusive deals, discounts, and personalized recommendations based on your browsing history. With Alexa integration and smart search, finding what you need is faster than ever. Save multiple delivery addresses, use one-tap payments, and shop safely anytime, anywhere. Amazon makes online shopping simple, seamless, and satisfying — everything you want, delivered right to your door.",
    "size": 70,
    "reviews": 2880,
    "ratingAvg": 4.5,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 830 },
      { "name": "5 star", "count": 1160 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/pinterest.com",
    "title": "Pinterest: Discover Ideas & Inspiration",
    "companyName": "Pinterest, Inc.",
    "id": 16,
    "description": "Pinterest is your creative inspiration hub. Explore millions of ideas for home décor, fashion, recipes, workouts, and more. Save your favorite Pins to organized boards and revisit them anytime. Whether you’re planning a wedding, designing a room, or cooking dinner, Pinterest helps you turn ideas into reality. Follow creators and discover trending styles personalized to your taste. Visual search lets you find similar ideas with a single tap. Share boards with friends for collaborative planning. Simple, visual, and inspiring — Pinterest transforms creativity into action and makes exploring your passions easier than ever before.",
    "size": 62,
    "reviews": 1930,
    "ratingAvg": 4.6,
    "downloads": "250M",
    "ratings": [
      { "name": "1 star", "count": 110 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 270 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 870 }
    ]
  }
]
